import { forwardRef, Ref, SVGProps } from 'react';

type FlagProps = SVGProps<SVGSVGElement> & {
  /** Размер флага в пикселях (выставляет width и height). */
  size?: number;
};

export const HongKongSVG = forwardRef<SVGSVGElement, FlagProps>(
  ({ size = 24, style, ...props }, ref: Ref<SVGSVGElement>) => (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      fill='none'
      viewBox='0 0 24 18'
      ref={ref}
      style={{ width: `${size}px`, height: `${size}px`, ...style }}
      {...props}
    >
      <g clipPath='url(#HongKong_svg__a)'>
        <path fill='#EE1C25' d='M0 0h24v18H0z' />
        <path
          fill='#fff'
          d='M13.168 3.756a.838.838 0 0 0-.448 1.253 1.355 1.355 0 0 1-.609 1.987 1.16 1.16 0 0 0-.324 1.93 2.05 2.05 0 0 1-.512-2.818l-.033-.032a2.096 2.096 0 0 0 .502 2.874 2.71 2.71 0 0 1 1.424-5.194'
        />
        <path fill='#EE1C25' d='m11.939 5.433-.827.36.881.195-.598-.675.087.898' />
        <path
          fill='#fff'
          d='M17.267 8.605a.838.838 0 0 0-1.33-.038 1.355 1.355 0 0 1-2.078.035 1.16 1.16 0 0 0-1.935.288 2.05 2.05 0 0 1 2.521-1.358l.02-.041a2.096 2.096 0 0 0-2.578 1.366 2.71 2.71 0 0 1 5.38-.252'
        />
        <path fill='#EE1C25' d='m15.292 7.954-.599-.675.088.898.457-.778-.827.36' />
        <path
          fill='#fff'
          d='M7.757 12.485a.837.837 0 0 0 1.098-.751 1.355 1.355 0 0 1 1.66-1.249 1.16 1.16 0 0 0 1.396-1.37 2.05 2.05 0 0 1-1.242 2.58l.009.045a2.096 2.096 0 0 0 1.282-2.62 2.71 2.71 0 0 1-4.203 3.365'
        />
        <path fill='#EE1C25' d='m9.736 11.85.881.195-.598-.675.088.898.457-.778' />
        <path
          fill='#fff'
          d='M13.922 14a.837.837 0 0 0-.375-1.277 1.355 1.355 0 0 1-.675-1.965 1.16 1.16 0 0 0-.871-1.751 2.05 2.05 0 0 1 2.07 1.978l.045.006a2.096 2.096 0 0 0-2.096-2.03A2.71 2.71 0 0 1 13.922 14'
        />
        <path fill='#EE1C25' d='m13.93 11.92.458-.777-.827.36.881.195-.598-.675' />
        <path
          fill='#fff'
          d='M7.291 6.154a.838.838 0 0 0 1.055.813 1.355 1.355 0 0 1 1.7 1.193 1.16 1.16 0 0 0 1.735.904 2.05 2.05 0 0 1-2.837-.383l-.04.022a2.097 2.097 0 0 0 2.888.41 2.71 2.71 0 0 1-4.5-2.959'
        />
        <path fill='#EE1C25' d='m8.507 7.841.087.898.457-.778-.827.36.881.195' />
      </g>
      <rect
        width={23.5}
        height={17.5}
        x={0.25}
        y={0.25}
        stroke='#DDE0EA'
        strokeWidth={0.5}
        rx={1.75}
        style={{
          fillOpacity: 0,
        }}
      />
      <defs>
        <clipPath id='HongKong_svg__a'>
          <rect width={24} height={18} fill='#fff' rx={2} />
        </clipPath>
      </defs>
    </svg>
  ),
);
