import { forwardRef, Ref, SVGProps } from 'react';

type FlagProps = SVGProps<SVGSVGElement> & {
  /** Размер флага в пикселях (выставляет width и height). */
  size?: number;
};

export const UzbekistanSVG = forwardRef<SVGSVGElement, FlagProps>(
  ({ size = 24, style, ...props }, ref: Ref<SVGSVGElement>) => (
    <svg
      xmlns='http://www.w3.org/2000/svg'
      fill='none'
      viewBox='0 0 24 18'
      ref={ref}
      style={{ width: `${size}px`, height: `${size}px`, ...style }}
      {...props}
    >
      <g clipPath='url(#Uzbekistan_svg__a)'>
        <g clipPath='url(#Uzbekistan_svg__b)'>
          <path fill='#F93939' d='M0 0h24v18H0z' />
          <path fill='#1EB53A' d='M0 12h24v6H0z' />
          <path fill='#0099B5' d='M0 0h24v6H0z' />
          <path fill='#CE1126' d='M0 5.76h24v6.48H0z' />
          <path fill='#fff' d='M0 6.12h24v5.76H0z' />
          <path
            fill='#fff'
            fillRule='evenodd'
            d='M5.4 5.01q-.176.03-.36.03A2.16 2.16 0 1 1 5.4.75a2.16 2.16 0 0 0 0 4.26M9.38 1.02l.313-.003L9.79.72l.1.296.311.002-.251.186.094.297-.254-.181-.254.181.095-.297zm0 1.727.313-.002.098-.296.1.296.311.002-.251.186.094.297-.254-.181-.254.181.095-.297zm.665 2.211-.254-.181-.254.181.095-.297-.251-.186.312-.002.098-.296.1.296.311.002-.251.186zm1.064-.483.312-.002.098-.296.1.296.311.002-.251.186.094.297-.254-.181-.254.181.095-.297zm0-1.728.312-.002.098-.296.1.296.311.002-.251.186.094.297-.254-.181-.254.181.095-.297zm0-1.728.312-.002.098-.296.1.296.311.002-.251.186.094.297-.254-.181-.254.181.095-.297zm1.728 3.456.312-.002.098-.296.099.296.312.002-.251.186.094.297-.254-.181-.254.181.095-.297zm0-1.728.312-.002.098-.296.099.296.312.002-.251.186.094.297-.254-.181-.254.181.095-.297zm0-1.728.312-.002.098-.296.099.296.312.002-.251.186.094.297-.254-.181-.254.181.095-.297zM5.924 4.475l.313-.002.098-.296.1.296.311.002-.25.186.093.297-.254-.181-.253.18.094-.296zm1.729 0 .312-.002.098-.295.099.295.312.002-.251.186.094.297-.254-.181-.253.18.094-.296zm0-1.728.312-.002.098-.295.099.295.312.002-.251.186.094.297-.254-.181-.253.18.094-.296z'
            clipRule='evenodd'
          />
        </g>
      </g>
      <rect
        width={23.5}
        height={17.5}
        x={0.25}
        y={0.25}
        stroke='#DDE0EA'
        strokeWidth={0.5}
        rx={1.75}
        style={{
          fillOpacity: 0,
        }}
      />
      <defs>
        <clipPath id='Uzbekistan_svg__a'>
          <rect width={24} height={18} fill='#fff' rx={2} />
        </clipPath>
        <clipPath id='Uzbekistan_svg__b'>
          <path fill='#fff' d='M0 0h24v18H0z' />
        </clipPath>
      </defs>
    </svg>
  ),
);
