// DO NOT EDIT IT MANUALLY

// TODO(FF-8488): убрать `type`-keyword согласно .claude/rules/imports-exports.md
// на следующей перегенерации иконок (`pnpm gen:icons`). Сейчас оставлено, чтобы
// соответствовать фактическому состоянию закоммиченных файлов src/components/.
import { forwardRef } from 'react';
import type { Ref } from 'react';
import type { ISvgIconProps } from '../../../../../../types';

const PdfSVG = forwardRef(({ size = 24, ...props }: ISvgIconProps, ref: Ref<SVGSVGElement>) => {
  const testId = '-pdf';
  const isCustomSize = typeof size === 'number';
  const sizePx = isCustomSize ? size : 24;
  const children = (
    <svg xmlns='http://www.w3.org/2000/svg' width={24} height={24} fill='none' {...props}>
      <path d='M4.24 5.62V8h1.52V4.76h9.935l-.107-.112-.107-.111.26-.258.259-.257v.733l-.141.013-.14.012 1.26 1.26c1.259 1.258 1.261 1.259 1.261 1.11V7h.779l-.268.269-.269.268-.121-.116-.121-.116V8h1.52V6.7l-1.73-1.73-1.73-1.73H4.24zm1.52-1.24v.38H5V4h.76zm-1.52 8.266c0 2.225.015 3.466.042 3.563.108.39.52.618.92.51.22-.059.454-.287.513-.5.026-.093.045-.511.045-1.004v-.845l.59-.02c.85-.028 1.325-.197 1.765-.625.252-.246.38-.453.515-.834.104-.297.109-.344.109-1.071-.001-.611-.015-.811-.073-1.02-.159-.568-.509-1.027-.969-1.269-.464-.245-.58-.26-2.087-.281l-1.37-.019zM9.5 9.287c-.011.029-.016 1.718-.01 3.753l.01 3.7 1.42.011c1.163.009 1.478 0 1.74-.052.853-.168 1.452-.692 1.73-1.516l.109-.323.001-1.84c0-2.004-.005-2.057-.231-2.54-.237-.507-.807-.951-1.469-1.147-.303-.09-3.268-.131-3.3-.046m5.74 3.361c0 2.224.015 3.464.042 3.561.108.39.52.618.92.51.22-.059.454-.287.513-.5.028-.099.045-.593.045-1.309v-1.15l.93-.001c.82-.001.949-.01 1.09-.075.295-.137.46-.381.46-.684a.67.67 0 0 0-.193-.494c-.225-.238-.262-.245-1.317-.259l-.97-.013V10.76h1.15c.716 0 1.21-.017 1.309-.045.212-.058.441-.293.5-.511.089-.331-.03-.638-.324-.832l-.169-.112-1.993-.012-1.993-.011zM5.76 10.38v.38h.499c.891 0 .954.064.973 1 .014.724-.021.835-.313.989-.152.08-.229.091-.665.091H5.76v1.52H5v-1.52h.76v-2.08H5V10h.76zm5.24-.003v.377l.73.013c.692.012.739.018.906.113a1 1 0 0 1 .26.213c.082.11.084.151.084 1.883v1.77l-.113.17c-.188.284-.323.322-1.157.323l-.71.001V16h-.76v-.76H11v-4.48h-.76V10H11zm5.76.003v.38H16V10h.76zm0 2.62v.76H16v-1.52h.76zM4.24 19.38v1.38h15.52V18h-1.52v1.24H5.76V18H4.24zm1.52.24V20H5v-.76h.76zm13.24 0V20h-.76v-.76H19z' />
    </svg>
  ).props.children;
  const style = isCustomSize
    ? {
        ...(props.style || {}),
        width: sizePx,
        height: sizePx,
      }
    : props.style;
  return (
    <svg
      ref={ref}
      xmlns='http://www.w3.org/2000/svg'
      width={sizePx}
      height={sizePx}
      fill='currentColor'
      viewBox='0 0 24 24'
      data-test-id={'icon' + testId}
      style={style}
      {...props}
    >
      {children}
    </svg>
  );
});
export default PdfSVG;
