// DO NOT EDIT IT MANUALLY

// TODO(FF-8488): убрать `type`-keyword согласно .claude/rules/imports-exports.md
// на следующей перегенерации иконок (`pnpm gen:icons`). Сейчас оставлено, чтобы
// соответствовать фактическому состоянию закоммиченных файлов src/components/.
import { forwardRef } from 'react';
import type { Ref } from 'react';
import type { ISvgIconProps } from '../../../../../../types';

const TxtSVG = forwardRef(({ size = 24, ...props }: ISvgIconProps, ref: Ref<SVGSVGElement>) => {
  const testId = '-txt';
  const isCustomSize = typeof size === 'number';
  const sizePx = isCustomSize ? size : 24;
  const children = (
    <svg xmlns='http://www.w3.org/2000/svg' width={24} height={24} fill='none' {...props}>
      <path d='M4.24 5.62V8h1.52V4.76h9.935l-.107-.112-.107-.111.26-.258.259-.257v.733l-.141.013-.14.012 1.26 1.26c1.259 1.258 1.261 1.259 1.261 1.11V7h.779l-.268.269-.269.268-.121-.116-.121-.116V8h1.52V6.7l-1.73-1.73-1.73-1.73H4.24zm1.52-1.24v.38H5V4h.76zm-.949 4.898a.76.76 0 0 0-.551.607c-.063.335.19.739.521.83.087.025.451.045.809.045h.65v2.65c0 1.699.015 2.703.042 2.799.108.39.52.618.92.51.22-.059.454-.287.513-.5.031-.109.045-.999.045-2.809v-2.65h.65c.358 0 .722-.02.809-.045.212-.058.441-.293.5-.511.089-.331-.03-.638-.324-.832l-.169-.112-2.143-.007c-1.179-.003-2.201.008-2.272.025m5.957.006c-.312.093-.565.508-.508.831.015.08.336.762.714 1.516l.687 1.37.399-.804c.22-.442.413-.812.429-.822s.214.352.441.804l.411.823.7-1.405c.647-1.3.699-1.419.697-1.616-.004-.415-.326-.723-.75-.717-.187.003-.264.026-.4.12-.149.103-.218.216-.614.996-.245.484-.46.877-.477.874-.018-.004-.231-.4-.474-.88-.387-.764-.463-.888-.603-.982a.84.84 0 0 0-.652-.108m5.043-.006a.76.76 0 0 0-.551.607c-.063.335.19.739.521.83.087.025.452.045.809.045h.65v2.65c0 1.699.015 2.703.042 2.799.108.39.52.618.92.51.22-.059.454-.287.513-.5.031-.109.045-.999.045-2.809v-2.65h.65c.358 0 .722-.02.809-.045.212-.058.441-.293.5-.511.089-.331-.03-.638-.324-.832l-.169-.112-2.143-.007c-1.179-.003-2.201.008-2.272.025M7.76 10.38v.38H6.24V10h1.52zm11 0v.38h-1.52V10h1.52zm-7.807 4.03c-.641 1.276-.688 1.385-.69 1.594-.005.627.737.974 1.218.569.085-.071.264-.383.562-.979.241-.481.446-.874.457-.874s.216.393.457.874c.298.596.477.908.562.979A.742.742 0 0 0 14.737 16c-.002-.203-.054-.323-.69-1.59-.378-.753-.696-1.37-.707-1.37s-.2.36-.42.8-.409.8-.42.8-.2-.36-.42-.8-.409-.8-.42-.8-.329.617-.707 1.37M4.24 19.38v1.38h15.52V18h-1.52v1.24H5.76V18H4.24zm1.52.24V20H5v-.76h.76zm13.24 0V20h-.76v-.76H19z' />
    </svg>
  ).props.children;
  const style = isCustomSize
    ? {
        ...(props.style || {}),
        width: sizePx,
        height: sizePx,
      }
    : props.style;
  return (
    <svg
      ref={ref}
      xmlns='http://www.w3.org/2000/svg'
      width={sizePx}
      height={sizePx}
      fill='currentColor'
      viewBox='0 0 24 24'
      data-test-id={'icon' + testId}
      style={style}
      {...props}
    >
      {children}
    </svg>
  );
});
export default TxtSVG;
